# Extra Practice
As you've probably seen, Pandas is an incredibly versatile and convenient tool to store, display, and transform tabular data. However, there are some nuances and redundancies that you should be aware of. These practice questions will hopefully elucidate some of these obscurities, as well as make you feel more comfortable working with Pandas.

## Creating Data Frames

Let's take this time to review the different ways to create a Data Frame. If you get stuck, you can look at some awesome slides [here](https://docs.google.com/presentation/d/1hwjcENCEm7blFBAXKcLZMT3t4xRr-HMV6N42UR1nTxU/edit#slide=id.g4114e65f62_0_239), the DS100 textbook [here](https://www.textbook.ds100.org/ch/03/pandas_intro.html), or at your Lab02 for reference!

### 1. df1

Use a dictionary to Create a DataFrame object that looks like this:



```

```

In [1]:
import pandas as po

df1 = po.DataFrame(data = {"letters": ['a', 'b', 'c', 'd', 'e'],
                    "numbers": [1, 2, 3, 4, 5],
                    "???": ['a', 2, 'c', 4, 'e']}, )
df1

  letters  numbers ???
0       a        1   a
1       b        2   2
2       c        3   c
3       d        4   4
4       e        5   e

What's the data type of the "???" column?

### 2. df2
Use the ```data``` and ```columns``` arguments to create the same DataFrame as ```df1```.

In [2]:
df2 = po.DataFrame(data = [['a',1, 'a'],
                          ['b', 2, 2],
                          ['c', 3, 'c'],
                          ['d', '4', '4'],
                          ['e', 5, 'e']], 
                   columns = ['letters', 'numbers', '???'],)
df2

  letters numbers ???
0       a       1   a
1       b       2   2
2       c       3   c
3       d       4   4
4       e       5   e

### 3. df3

Set df3 to a **copy** of df1. Then, change the index of df3 to match the DataFrame below.

In [3]:
df3 = df1.copy()
df3.index = [42,3,9999,7,5]
df3

     letters  numbers ???
42         a        1   a
3          b        2   2
9999       c        3   c
7          d        4   4
5          e        5   e

Sanity check: Why do we use a copy?

## Indexing Practice

You can review some awesome slides from DS100 Summer 2019 [here](https://docs.google.com/presentation/d/1hwjcENCEm7blFBAXKcLZMT3t4xRr-HMV6N42UR1nTxU/edit#slide=id.g4114e65f62_0_239).


Let's now index on the DataFrames that you created!

For the following questions, give the same data using the three indexing methods: [ ], loc[ ], and iloc[ ]. You can use the ```type()``` function to check the data type of your output.

### 1a. First three rows of df1 as a DataFrame

In [4]:
# use []
df1[0:3]

  letters  numbers ???
0       a        1   a
1       b        2   2
2       c        3   c

In [5]:
# use loc

df1.loc[0:2]

  letters  numbers ???
0       a        1   a
1       b        2   2
2       c        3   c

In [6]:
# use iloc

df1.iloc[0:3]

  letters  numbers ???
0       a        1   a
1       b        2   2
2       c        3   c

### 1b. First three rows of df3 as a DataFrame

In [7]:
# use []
df3[0:3]

     letters  numbers ???
42         a        1   a
3          b        2   2
9999       c        3   c

In [8]:
# use loc[]
df3.loc[[42, 3, 9999]]

     letters  numbers ???
42         a        1   a
3          b        2   2
9999       c        3   c

In [9]:
# use iloc[]
df3.iloc[0:3]

     letters  numbers ???
42         a        1   a
3          b        2   2
9999       c        3   c

### 2a. First column of df2 as a DataFrame

In [10]:
# use []
df2[['letters']]

  letters
0       a
1       b
2       c
3       d
4       e

In [11]:
# use loc[]
df2.loc[:, ['letters']]

  letters
0       a
1       b
2       c
3       d
4       e

In [12]:
# use iloc[]
df2.iloc[:, [1]]

  numbers
0       1
1       2
2       3
3       4
4       5

### 3a. The first row of df3 as a DataFrame

In [13]:
# use []
df3[0:1]

   letters  numbers ???
42       a        1   a

In [14]:
# use loc[]
df3.loc[[42], :]

   letters  numbers ???
42       a        1   a

In [15]:
# use iloc[]
df3.iloc[[0], :]

   letters  numbers ???
42       a        1   a

### 4a. The second, fourth, and fifth row of the numbers column in df3 as a Series.

In [16]:
import numpy as np
# use []
df3[[False, True, False, True, True]]['numbers']

3    2
7    4
5    5
Name: numbers, dtype: int64

In [17]:
# use loc[]
df3.loc[[3, 7, 5], 'numbers']

3    2
7    4
5    5
Name: numbers, dtype: int64

In [18]:
# use iloc[]
df3.iloc[[1, 3, 4], 1]

3    2
7    4
5    5
Name: numbers, dtype: int64

### 4b. The second, fourth, and fifth row of the numbers column in df3 as a DataFrame.

In [19]:
# use []
df3[[False, True, False, True, True]][['numbers']]

   numbers
3        2
7        4
5        5

In [20]:
# use loc[]
df3.loc[[3, 7, 5], ['numbers']]

   numbers
3        2
7        4
5        5

In [21]:
# use iloc[]
df3.iloc[[1, 3, 4], [1]]

   numbers
3        2
7        4
5        5

## Groupby Practice

You can review .groupby() [here](https://www.textbook.ds100.org/ch/03/pandas_grouping_pivoting.html)

Great visual representation of how grouping works [here](https://docs.google.com/presentation/d/1PuaVQkMaytd6fK-jb_FSnYn54EgWIhLThSsHFbNq6Rs/edit#slide=id.g4114e65f62_0_517)! (slides 12, 13). [Source](http://www.ds100.org/su19/syllabus)

#### Let's use a wine dataset, because wine not (ha).

In [22]:
### Loading in data

import urllib.request
import os.path
import zipfile

import pandas as pd
import numpy as np

# load data
local_filename = "wine_data.csv"
wines = pd.read_csv(local_filename, header = 'infer')

# change data
ratings = pd.read_csv("my_ratings.csv", header = None)
wines = wines.merge(ratings, left_on = wines.index, right_on = ratings.index).drop(columns=['key_0'])
wines = wines.rename({0: 'Rating'}, axis = 'columns')
wines['Color intensity'] = wines['Color intensity'].astype('int64')
wines.head(7)

,Class,Alcohol,Malic acid,Ash,Alcalinity of ash,Magnesium,Total phenols,Flavanoids,Nonflavanoid phenols,Proanthocyanins,Color intensity,Hue,OD280/)D315 of diluted wines,Proline,Rating
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5,1.04,3.92,1065,9
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4,1.05,3.40,1050,8
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5,1.03,3.17,1185,9
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7,0.86,3.45,1480,8
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4,1.04,2.93,735,7
5,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6,1.05,2.85,1450,9
6,1,14.39,1.87,2.45,14.6,96,2.50,2.52,0.30,1.98,5,1.02,3.58,1290,6

### Data description
1. Title of Database: Wine recognition data
       Updated Sept 21, 1998 by C.Blake : Added attribute information

2. Sources:
   (a) Forina, M. et al, PARVUS - An Extendible Package for Data
       Exploration, Classification and Correlation. Institute of Pharmaceutical
       and Food Analysis and Technologies, Via Brigata Salerno, 
       16147 Genoa, Italy.

   (b) Stefan Aeberhard, email: stefan@coral.cs.jcu.edu.au
   (c) July 1991

4. Relevant Information:

   -- These data are the results of a chemical analysis of
      wines grown in the same region in Italy but derived from three
      different cultivars.
      The analysis determined the quantities of 13 constituents
      found in each of the three types of wines. 

   -- I think that the initial data set had around 30 variables, but 
      for some reason I only have the 13 dimensional version. 
      I had a list of what the 30 or so variables were, but a.) 
      I lost it, and b.), I would not know which 13 variables
      are included in the set.

8. Missing Attribute Values: None

9. Class Distribution: number of instances per class

    * class 1 59
	* class 2 71
	* class 3 48

### Summary statistics of wines

In [23]:
wines.describe()

,Class,Alcohol,Malic acid,Ash,Alcalinity of ash,Magnesium,Total phenols,Flavanoids,Nonflavanoid phenols,Proanthocyanins,Color intensity,Hue,OD280/)D315 of diluted wines,Proline,Rating
count,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000
mean,1.938202,13.000618,2.336348,2.366517,19.494944,99.741573,2.295112,2.029270,0.361854,1.590899,4.573034,0.957449,2.611685,746.893258,4.359551
std,0.775035,0.811827,1.117146,0.274344,3.339564,14.282484,0.625851,0.998859,0.124453,0.572359,2.342859,0.228572,0.709990,314.907474,2.770903
min,1.000000,11.030000,0.740000,1.360000,10.600000,70.000000,0.980000,0.340000,0.130000,0.410000,1.000000,0.480000,1.270000,278.000000,0.000000
25%,1.000000,12.362500,1.602500,2.210000,17.200000,88.000000,1.742500,1.205000,0.270000,1.250000,3.000000,0.782500,1.937500,500.500000,2.000000
50%,2.000000,13.050000,1.865000,2.360000,19.500000,98.000000,2.355000,2.135000,0.340000,1.555000,4.000000,0.965000,2.780000,673.500000,3.000000
75%,3.000000,13.677500,3.082500,2.557500,21.500000,107.000000,2.800000,2.875000,0.437500,1.950000,6.000000,1.120000,3.170000,985.000000,6.000000
max,3.000000,14.830000,5.800000,3.230000,30.000000,162.000000,3.880000,5.080000,0.660000,3.580000,13.000000,1.710000,4.000000,1680.000000,9.000000

In [24]:
# Number of unique values for each column
for c in wines.columns:
    print(c, len(wines[c].unique()))

Class 3
Alcohol 126
Malic acid 133
Ash 79
Alcalinity of ash 63
Magnesium 53
Total phenols 97
Flavanoids 132
Nonflavanoid phenols 39
Proanthocyanins 101
Color intensity 12
Hue 78
OD280/)D315 of diluted wines 122
Proline 121
Rating 10

### 1. For each class, find the max alcohol content

In [25]:
### SOLUTION ###

display(wines.groupby('Class').max()['Alcohol'],
        wines['Alcohol'].groupby(wines['Class']).max())

Class
1    14.83
2    13.86
3    14.34
Name: Alcohol, dtype: float64

Class
1    14.83
2    13.86
3    14.34
Name: Alcohol, dtype: float64

### 2. For each class, find the count of alcoholic beverages greater than 13.5%.

In [26]:
### SOLUTION ###

display(wines[wines['Alcohol'] > 13.5].groupby('Class').count().iloc[:, 0],
        wines[wines['Alcohol'] > 13.5].iloc[:, 0].groupby(wines['Class']).count()
       )

Class
1    41
2     2
3    12
Name: Alcohol, dtype: int64

Class
1    41
2     2
3    12
Name: Class, dtype: int64

### 3. For each class, find the average rating

In [27]:
### SOLUTION ###

display(wines.groupby('Class').mean()['Rating'],
        wines['Rating'].groupby(wines['Class']).mean()
       )

Class
1    7.576271
2    1.830986
3    4.145833
Name: Rating, dtype: float64

Class
1    7.576271
2    1.830986
3    4.145833
Name: Rating, dtype: float64

(From the above 3 questions, what can you infer about the Rating column?)

### 4. For each rating, find the count for each class

In [28]:
### SOLUTION ###
wines.groupby(['Rating', 'Class']).count().iloc[:, [0]]

              Alcohol
Rating Class
0      2           15
1      2            9
2      2           20
       3           10
3      2           27
       3           10
4      3            4
5      3           11
6      1           15
       3           13
7      1           16
8      1            7
9      1           21

### 5. For each level of color intensity that is equal to 4 or 6 or 8, find the average Flavanoids

In [29]:
### SOLUTION ###

wines[(wines['Color intensity'] == 4)
     | (wines['Color intensity'] == 6)
     | (wines['Color intensity'] == 8)].groupby('Color intensity').mean()['Flavanoids']

Color intensity
4    2.076000
6    3.124286
8    1.768571
Name: Flavanoids, dtype: float64

### 6. For each rating, find the first row

In [30]:
wines.groupby('Rating').first()

,Class,Alcohol,Malic acid,Ash,Alcalinity of ash,Magnesium,Total phenols,Flavanoids,Nonflavanoid phenols,Proanthocyanins,Color intensity,Hue,OD280/)D315 of diluted wines,Proline
Rating,,,,,,,,,,,,,,
0,2,12.21,1.19,1.75,16.8,151,1.85,1.28,0.14,2.50,2,1.28,3.07,718
1,2,13.67,1.25,1.92,18.0,94,2.10,1.79,0.32,0.73,3,1.23,2.46,630
2,2,12.33,1.10,2.28,16.0,101,2.05,1.09,0.63,0.41,3,1.25,1.67,680
3,2,12.37,0.94,1.36,10.6,88,1.98,0.57,0.28,0.42,1,1.05,1.82,520
4,3,13.08,3.90,2.36,21.5,113,1.41,1.39,0.34,1.14,9,0.57,1.33,550
5,3,12.81,2.31,2.40,24.0,98,1.15,1.09,0.27,0.83,5,0.66,1.36,560
6,1,14.39,1.87,2.45,14.6,96,2.50,2.52,0.30,1.98,5,1.02,3.58,1290
7,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4,1.04,2.93,735
8,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4,1.05,3.40,1050
9,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5,1.04,3.92,1065

### 7. For each rating, find the third row

Hint: Up until now, we've been using built-in aggregation methods, like .mean() and .count(). If we have a custom aggregation function, we can use .agg(), which takes in a function. 

Hint: Remember that .mean(), .count(), etc. is applied on each group.

In [31]:
wines.groupby('Rating').agg(lambda group: group.iloc[2])

,Class,Alcohol,Malic acid,Ash,Alcalinity of ash,Magnesium,Total phenols,Flavanoids,Nonflavanoid phenols,Proanthocyanins,Color intensity,Hue,OD280/)D315 of diluted wines,Proline
Rating,,,,,,,,,,,,,,
0,2,11.84,2.89,2.23,18.0,112,1.72,1.32,0.43,0.95,2,0.960,2.52,500
1,2,13.11,1.01,1.70,15.0,78,2.98,3.18,0.26,2.28,5,1.120,3.18,502
2,2,12.29,1.61,2.21,20.4,103,1.10,1.02,0.37,1.46,3,0.906,1.82,870
3,2,12.37,1.13,2.16,19.0,87,3.50,3.10,0.19,1.87,4,1.220,2.87,420
4,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7,0.640,1.74,740
5,3,12.25,4.72,2.54,21.0,89,1.38,0.47,0.53,0.80,3,0.750,1.27,720
6,1,13.75,1.73,2.41,16.0,89,2.60,2.76,0.29,1.81,5,1.150,2.90,1320
7,1,14.12,1.48,2.32,16.8,95,2.20,2.43,0.26,1.57,5,1.170,2.82,1280
8,1,14.38,1.87,2.38,12.0,102,3.30,3.64,0.29,2.96,7,1.200,3.00,1547
9,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6,1.050,2.85,1450

In [32]:
def get_third_row(group):
    return group.iloc[2]

wines.groupby('Rating').agg(get_third_row)

,Class,Alcohol,Malic acid,Ash,Alcalinity of ash,Magnesium,Total phenols,Flavanoids,Nonflavanoid phenols,Proanthocyanins,Color intensity,Hue,OD280/)D315 of diluted wines,Proline
Rating,,,,,,,,,,,,,,
0,2,11.84,2.89,2.23,18.0,112,1.72,1.32,0.43,0.95,2,0.960,2.52,500
1,2,13.11,1.01,1.70,15.0,78,2.98,3.18,0.26,2.28,5,1.120,3.18,502
2,2,12.29,1.61,2.21,20.4,103,1.10,1.02,0.37,1.46,3,0.906,1.82,870
3,2,12.37,1.13,2.16,19.0,87,3.50,3.10,0.19,1.87,4,1.220,2.87,420
4,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7,0.640,1.74,740
5,3,12.25,4.72,2.54,21.0,89,1.38,0.47,0.53,0.80,3,0.750,1.27,720
6,1,13.75,1.73,2.41,16.0,89,2.60,2.76,0.29,1.81,5,1.150,2.90,1320
7,1,14.12,1.48,2.32,16.8,95,2.20,2.43,0.26,1.57,5,1.170,2.82,1280
8,1,14.38,1.87,2.38,12.0,102,3.30,3.64,0.29,2.96,7,1.200,3.00,1547
9,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6,1.050,2.85,1450

### 8. For each alcohol level rounded DOWN to the nearest integer, find the average rating only including instances with a rating between 3 and 8 (inclusive), and multiply it by 10.

Hint: look up Series.astype()

In [33]:
def average_times_10(group):
    return np.mean(group) * 10

wines[(wines['Rating'] >= 3) & (wines['Rating'] <= 8)].groupby(wines['Alcohol'].astype(int)).agg(average_times_10)['Rating']

Alcohol
11    30.000000
12    38.974359
13    57.954545
14    66.428571
Name: Rating, dtype: float64

In [36]:
# Congrats! You made it to the end :)